/********************************************************************************/
/*   Copyright (c) 2021 Realtek Semiconductor Corp. All rights reserved.        */
/*                                                                              */
/*   SPDX-License-Identifier: LicenseRef-Realtek-Proprietary                    */
/*                                                                              */
/*   This software component is confidential and proprietary to Realtek         */
/*   Semiconductor Corp. Disclosure, reproduction, redistribution, in whole     */
/*   or in part, of this work and its derivatives without express permission    */
/*   is prohibited.                                                             */
/********************************************************************************/

//----------------------------------------------------------------------------------------------------
// ID Code      : TypeC_Pmic_MPS_MP4247.c
// Update Note  :
//----------------------------------------------------------------------------------------------------

#include "UserCommonInclude.h"

#if(_TYPE_C_PMIC_TYPE == _PMIC_MP4247)

//****************************************************************************
// LAYER DEFINITIONS / MACROS
//****************************************************************************
//--------------------------------------------------
// Register Addresss
//--------------------------------------------------

//--------------------------------------------------
// Register Addresss
//--------------------------------------------------
#define _MP4247_SUBADDR_LENGTH                      0x01
#define _MP4247_DATA_LENGTH_1                       0x01
#define _MP4247_DATA_LENGTH_2                       0x02

//--------------------------------------------------
// Definitions of Voltage(250mV)
//--------------------------------------------------
#define _MP4247_OUTPUT_VOL_0V                       0x0000
#define _MP4247_OUTPUT_VOL_3V                       0x000C
#define _MP4247_OUTPUT_VOL_5V                       0x0014
#define _MP4247_OUTPUT_VOL_7V                       0x001C
#define _MP4247_OUTPUT_VOL_9V                       0x0024
#define _MP4247_OUTPUT_VOL_12V                      0x0030
#define _MP4247_OUTPUT_VOL_15V                      0x003C
#define _MP4247_OUTPUT_VOL_20V                      0x0050

//--------------------------------------------------
// Definitions of Current(Rsense 10m ohm)
//--------------------------------------------------
#define _MP4247_OUTPUT_CURRENT_LIMIT_1_0A           0x14
#define _MP4247_OUTPUT_CURRENT_LIMIT_1_5A           0x1E
#define _MP4247_OUTPUT_CURRENT_LIMIT_2_0A           0x28
#define _MP4247_OUTPUT_CURRENT_LIMIT_2_5A           0x32
#define _MP4247_OUTPUT_CURRENT_LIMIT_3_0A           0x3C
#define _MP4247_OUTPUT_CURRENT_LIMIT_3_25A          0x41
#define _MP4247_OUTPUT_CURRENT_LIMIT_3_5A           0x46
#define _MP4247_OUTPUT_CURRENT_LIMIT_4_0A           0x50
#define _MP4247_OUTPUT_CURRENT_LIMIT_4_5A           0x5A
#define _MP4247_OUTPUT_CURRENT_LIMIT_5_0A           0x64

//--------------------------------------------------
// Definitions of Operation Mode
//--------------------------------------------------
#define _MP4247_MODE_OFF                            0x00
#define _MP4247_MODE_ON                             0x80

//--------------------------------------------------
// Definitions of Discharge Control
//--------------------------------------------------
#define _MP4247_DISCHANGE_DISABLE                   0x00
#define _MP4247_DISCHANGE_ENABLE                    0x01

//--------------------------------------------------
// Macros of PMIC Default STATUS
//--------------------------------------------------
#define _MP4247_OPEARTION_DEFAULT                   0x00
#define _MP4247_VOUT_COMMAND_DEFAULT                _MP4247_OUTPUT_VOL_5V
#define _MP4247_MFR_CTRL1_DEFAULT                   0x2F
#define _MP4247_MFR_CURRENT_LIMIT_DEFAULT           0x3C
#define _MP4247_MFR_CTRL2_DEFAULT                   0x00
#define _MP4247_MFR_CTRL3_DEFAULT                   0x84 // Select the Rsens resistor value: 0: 5mo, Default; 1: 10mo
#define _MP4247_MFR_CTRL4_DEFAULT                   0x27
#define _MP4247_MFR_STATUS_MASK_DEFAULT             0xBF


//****************************************************************************
// STRUCT / TYPE / ENUM DEFINITTIONS
//****************************************************************************
typedef struct
{
    BYTE ucOperation; // 0x01 OPERATION  0x00 OFF , 0x80 ON
    WORD usVoutCommand; // 0x21 VOUT_COMMAND
    BYTE ucMfrCtrl1; // 0xD0 MFR_CTRL1
    BYTE ucMfrCurrentLimit; // 0xD1 MFR_CURRENT_LIMIT
    BYTE ucMfrCtrl2; // 0xD2 MFR_CTRL2
    BYTE ucMfrCtrl3; // 0xD3 MFR_CTRL3
    BYTE ucMfrCtrl4; // 0xD4 MFR_CTRL4
    BYTE ucMfrStatusMask; // 0xD8 MFR_STATUS_MASK
} StructMP4247RegisterMap;


//****************************************************************************
// CODE TABLES
//****************************************************************************
BYTE code tPMIC_MP4247_ADDRESS_TABLE[][2] =
{
    {_MP4247_OPEARTION,                 _MP4247_DATA_LENGTH_1},
    {_MP4247_VOUT_COMMAND,              _MP4247_DATA_LENGTH_2},
    {_MP4247_MFR_CTRL1,                 _MP4247_DATA_LENGTH_1},
    {_MP4247_MFR_CURRENT_LIMIT,         _MP4247_DATA_LENGTH_1},
    {_MP4247_MFR_CTRL2,                 _MP4247_DATA_LENGTH_1},
    {_MP4247_MFR_CTRL3,                 _MP4247_DATA_LENGTH_1},
    {_MP4247_MFR_CTRL4,                 _MP4247_DATA_LENGTH_1},
    {_MP4247_MFR_STATUS_MASK,           _MP4247_DATA_LENGTH_1},
    {_MP4247_REGISTER_END,              0x00},
};

StructMP4247RegisterMap code tPMIC_MP4247_INITIAL_TABLE =
{
    _MP4247_OPEARTION_DEFAULT,
    _MP4247_VOUT_COMMAND_DEFAULT,
